TheCreativeDodo/esp32_p4_jc1060p470_board/examples/getting_started/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_BSP_LCD_TYPE_1024_600=y
CONFIG_BSP_LCD_COLOR_FORMAT_RGB565=y
CONFIG_LV_BUILD_DEMOS=y
CONFIG_LV_USE_DEMO_MUSIC=y
# CONFIG_EXAMPLE_STARTUP_SPEAKER_BEEP is not set
CONFIG_EXAMPLE_USE_LVGL_MUSIC_DEMO=y
